---
title: with-env
categories: |
  env
version: 0.86.0
env: |
  Runs a block with an environment variable set.
usage: |
  Runs a block with an environment variable set.
---
<!-- This file is automatically generated. Please edit the command in https://github.com/nushell/nushell instead. -->

# <code>{{ $frontmatter.title }}</code> for env

<div class='command-title'>{{ $frontmatter.env }}</div>

## Signature

```> with-env {flags} (variable) (block)```

## Parameters

 -  `variable`: the environment variable to temporarily set
 -  `block`: the block to run once the variable is set


## Input/output types:

| input | output |
| ----- | ------ |
| any   | any    |

## Examples

Set the MYENV environment variable
```nu
> with-env [MYENV "my env value"] { $env.MYENV }
my env value
```

Set by primitive value list
```nu
> with-env [X Y W Z] { $env.X }
Y
```

Set by single row table
```nu
> with-env [[X W]; [Y Z]] { $env.W }
Z
```

Set by key-value record
```nu
> with-env {X: "Y", W: "Z"} { [$env.X $env.W] }
╭───┬───╮
│ 0 │ Y │
│ 1 │ Z │
╰───┴───╯

```
